// src/utils/remingtonMap.ts

// Normal Keys (विना Shift)
export const normalKeyMap: Record<string, string> = {
  // १ ते ० अंक आणि चिन्हे
  "`": "़",
  "1": "१",
  "2": "२",
  "3": "३",
  "4": "४",
  "5": "५",
  "6": "६",
  "7": "७",
  "8": "८",
  "9": "९",
  "0": "०",
  "-": "-",
  "=": "ृ", // ऋ-कार (उदा. कृपा)

  // Top Row (QWERTY)
  q: "ु", // उ-कार
  w: "ू", // ऊ-कार
  e: "म",
  r: "त",
  t: "ज",
  y: "ल",
  u: "न",
  i: "प",
  o: "व",
  p: "च",
  "[": "ख्",
  "]": ",",
  "\\": ".",

  // Home Row (ASDF)
  a: "ं", // अनुस्वार
  s: "े", // एक मात्रा
  d: "क",
  f: "ि", // पहिली वेलांटी (बफर लॉजिक)
  g: "ह",
  h: "ी", // दुसरी वेलांटी
  j: "र",
  k: "\u093E", // काना
  l: "स",
  ";": "य",
  "'": "श",

  // Bottom Row (ZXCV)
  z: "्र", // पद्यातील रकार (उदा. प्रकाश)
  x: "ग",
  c: "ब",
  v: "अ",
  b: "इ",
  n: "द",
  m: "उ",
  ",": "ए",
  ".": "ण्",
  "/": "ध्",
  " ": " ",
};

// Shift Keys (Shift सह)
export const shiftKeyMap: Record<string, string> = {
  // Number Row सह येणारी Shift Keys
  "~": "र्‍",
  "!": "!",
  "@": "ॅ", // उदा. बॅट, कॅट
  "#": "्र", // पद्यातील रकार
  "$": "\u0930\u094D", // रफार (र्)
  "%": "ः", // विसर्ग
  "^": "‘",
  "&": "’",
  "*": "ँ", // चंद्रबिंदू
  "(": "त्र",
  ")": "ऋ",
  "_": "–",
  "+": "्",

  // Top Row (Shift)
  Q: "फ",
  W: "ॉ", // उदा. डॉक्टर
  E: "म्",
  R: "त्",
  T: "ज्",
  Y: "ल्",
  U: "न्",
  I: "प्",
  O: "व्",
  P: "च्",
  "{": "क्ष",
  "}": "द्व",
  "|": "द्य",

  // Home Row (Shift)
  A: "ँ",
  S: "ै", // दोन मात्रा
  D: "क्",
  F: "थ्",
  G: "ळ",
  H: "भ",
  J: "श्र",
  K: "ज्ञ",
  L: "स्",
  ":": "रू",
  '"': "ष्",

  // Bottom Row (Shift)
  Z: "\u0930\u094D", // रफार (र्)
  X: "ग्",
  C: "ब्",
  V: "ट",
  B: "ठ",
  N: "छ",
  M: "ड",
  "<": "ढ",
  ">": "झ",
  "?": "घ",
};