// src/utils/remingtonMap.ts

// १. विना-Shift कीज (Normal Typing)
export const normalKeyMap: Record<string, string> = {
  // Number Row (मराठी अंक)
  "`": "`",
  "1": "१",
  "2": "२",
  "3": "३",
  "4": "४",
  "5": "५",
  "6": "६",
  "7": "७",
  "8": "८",
  "9": "९",
  "0": "०",
  "-": "-",
  "=": "ृ",

  // Top Row
  "q": "ु",
  "w": "ू",
  "e": "म",
  "r": "त",
  "t": "ज",
  "y": "ल",
  "u": "न",
  "i": "प",
  "o": "व",
  "p": "च",
  "[": "ख",
  "]": ",",
  "\\": ".",

  // Home Row
  "a": "ं",
  "s": "े",
  "d": "क",
  "f": "ि",
  "g": "ह",
  "h": "ी",
  "j": "र",
  "k": "ा",
  "l": "स",
  ";": "य",
  "'": "श्",

  // Bottom Row
  "z": "्र",
  "x": "ग",
  "c": "ब",
  "v": "अ",
  "b": "इ",
  "n": "द",
  "m": "उ",
  ",": "ए",
  ".": "ण्",
  "/": "ध्",
};

// २. Shift दाबली असताना मिळणाऱ्या कीज (Shift Typing)
export const shiftKeyMap: Record<string, string> = {
  // Number Row (Shift Symbols)
  "~": "द्य",
  "!": "!",
  "@": "/",
  "#": "ः",
  "$": "ऱ्",
  "%": "-",
  "^": "‘",
  "&": "’",
  "*": "द्ध",
  "(": "त्र",
  ")": "ऋ",
  "_": "_",
  "+": "्",

  // Top Row (Shift Keys)
  "Q": "फ",
  "W": "ॅ",
  "E": "म्",
  "R": "त्",
  "T": "ज्",
  "Y": "ल्",
  "U": "न्",
  "I": "प्",
  "O": "व्",
  "P": "च्",
  "{": "क्ष",
  "}": "द्व",
  "|": ")",

  // Home Row (Shift Keys)
  "A": "ा",
  "S": "ै",
  "D": "क्",
  "F": "थ्",
  "G": "ळ",
  "H": "भ्",
  "J": "श्र",
  "K": "ज्ञ",
  "L": "स्",
  ":": "रू",
  "\"": "ष्",

  // Bottom Row (Shift Keys)
  "Z": "र्",
  "X": "ग्",
  "C": "ब्",
  "V": "ट",
  "B": "ठ",
  "N": "छ",
  "M": "ड",
  "<": "ढ",
  ">": "झ",
  "?": "घ्",
};